from core import speak
import plyer

flash_on = ("Включи фонарик", "включи фонарик", "Включи фонарь", "включи фонарь", "Включи вспышку", "включи вспышку", "Активируй фонарь", "активируй фонарь", "Активируй фонарик", "активируй фонарик", "Активируй вспышку", "активируй вспышку", "Включить фонарь", "включить фонарь", "Включить фонарик", "включить фонарик")
flash_off = ("Выключи фонарик", "выключи фонарик", "Выключи фонарь", "выключи фонарь", "Выключи вспышку", "выключи вспышку", "Деактивируй фонарь", "деактивируй фонарь", "Деактивируй фонарик", "деактивируй фонарик", "Деактивируй вспышку", "деактивируй вспышку", "Выключить фонарь", "выключить фонарь", "Выключить фонарик", "выключить фонарик")

def main(say, widget):
    for i in flash_on:
        if i in say:
            try:
                plyer.flash.on()
                toSpeak = "Фонарик включен."
            except Exception:
                toSpeak = "Не удалось включить фонарик."
            break
        else:
            toSpeak = ""
            
    for i in flash_off:
        if i in say:
            try:
                plyer.flash.off()
                toSpeak = "Фонарик выключен."
            except Exception:
                toSpeak = "Не удалось выключить фонарик."
            break
        
    if toSpeak != "":
        speak.speak(toSpeak, widget)
    return toSpeak
